In [1]:
pip install pymysql

Requirement already satisfied: pymysql in /Users/kb/opt/anaconda3/lib/python3.8/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/kb/opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /Users/kb/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

········

In [5]:
connection_string = 'mysql+pymysql://kb:' + password + '@localhost/sakila'

In [6]:
engine = create_engine(connection_string)

In [13]:
may = pd.read_sql_query('''select count(*) as mayCount
,customer_id
from sakila.rentals_may
group by customer_id;''', engine)
may

     mayCount  customer_id
0           2            1
1           1            2
2           2            3
3           3            5
4           3            6
..        ...          ...
515         4          594
516         1          595
517         6          596
518         2          597
519         1          599

[520 rows x 2 columns]

In [14]:
june = pd.read_sql_query('''select count(*) as juneCount
,customer_id
from sakila.rentals_june
group by customer_id;''', engine)
june

     juneCount  customer_id
0            7            1
1            1            2
2            4            3
3            6            4
4            5            5
..         ...          ...
585          2          595
586          2          596
587          3          597
588          1          598
589          4          599

[590 rows x 2 columns]

In [61]:
merged = may.merge(june, how='outer', on='customer_id')

In [62]:
merged

     mayCount  customer_id  juneCount
0         2.0            1        7.0
1         1.0            2        1.0
2         2.0            3        4.0
3         3.0            5        5.0
4         3.0            6        4.0
..        ...          ...        ...
593       NaN          583        6.0
594       NaN          585        4.0
595       NaN          591        3.0
596       NaN          592        5.0
597       NaN          598        1.0

[598 rows x 3 columns]

In [78]:
def rentalCount(x):
    n = input("Enter customer id:")
    tcust=x[x['customer_id'].isin([int(n)])].reset_index()
    if tcust.juneCount[0]>tcust.mayCount[0]:
        return "more"
    elif tcust.juneCount[0]<tcust.mayCount[0]:
        return "less"
    else:
        return "same"

In [79]:
rentalCount(merged)

Enter customer id:593

'more'